package MyJavaStudy;

public class AboutObject {

    //객체지향의 관하여 ..
    //자바는 객체지향 언어이며 프로그램을 구현할 때 객체를 기반으로 작업한다.
    //C와 Java의 특징을 비교하면 C는 절차적 프로그래밍 언어 Java는 객체지향 프로그래밍언어이다.
    //절차적 프로그래밍이란? ==> 프로그램을 실행하는 데 필요한 모든 데이터를 준비하고, 준비된 데이터를 사용하여 순서대로 처리해 나가는 방식
    //객체 지향 프로그래밍이란? ==> 작업 순서를 중요하게 생각하지 않고 기능별로 작업을 분리한 후 기능을 가져다 쓰는 방식
    //객체 지향 프로그래밍의 장점
    //유지 보수성 : 새로운 것으로 교체하거나 변경할 때 변경된 부분만 교체 하면 된다.
    //클래스(class)란? : 객체를 만드는 틀
    //객체는 '클래스'로 속성은 '필드'로 동작은 '메서드'로 변경

    //객체 모델을 클래스 다이어그램으로 변환

    //필드 -> 이름 : 타입
    //메서드 -> 이름()
    //클래스 다이어그램에서는 필드에 대입할 실제 값이나 메서드가 어떻게 동작하는지 등의 구체적인 내용은 나타내지 않고 참고자료라 생각하면 된다.

    //클래스의 기본 구조
    //모델링한 객체를 클래스 다이어그램으로 표현하는 작업을 마친 후 마지막으로 클래스 다이어그램을 보고 자바 소스 파일을 작성한다. 소스파일은 클래스 단위로 작업한다.
    //[클래스 선언]
    // class 클래스명{
    //  필드 선언;
    //  메서드 선언
    // }


    public static void main(String[] args) {

    }
}
